
# coding: utf-8

# In[1]:


import os
import pandas as pd
import sklearn
import numpy as np


# In[91]:


os.getcwd()


# In[346]:


os.chdir(r"C:\Users\최보경\Desktop\2018JUNIOR\01-데이터관리와지적경영\teamdata")


# In[382]:


#raw data 4/30-6/2일자 자르기, 컬럼 이름 달기
originalstationpop_df=pd.read_csv('seoul_station_population.csv',header=None)
stationpop1_df=originalstationpop_df.iloc[2:16894]
stationpop1_df.columns=['date','line','station','getin','getout','del']
stationpop1_df.drop('del',axis=1,inplace=True)


# In[418]:


#승하차 인원 데이터 타입이 integer 으로, 연산을 위해 float으로 변경
stationpop1_df['getin']=stationpop1_df.getin.astype(float)
stationpop1_df['getout']=stationpop1_df.getout.astype(float)


# In[422]:


stationpop1_df.dtypes


# In[423]:


#sum(getin,getout)=total승하차인원
stationpop1_df['totalpopulation']=stationpop1_df.iloc[:,3:5].sum(axis=1)


# In[424]:


stationpop1_df.head()


# In[425]:


#승하차 전체 인원만 두고, 승차 하차 컬럼 삭제
stationpop1_df.drop(['getin','getout'],axis=1,inplace=True)


# In[393]:


stationpop_df.head()


# In[394]:


#cleansing data 1차 저장
stationpop_df.to_csv('REAL_totalpop.txt',index=None)


# In[121]:


#1차 역별 정렬(후에 groupby sum으로 다시 함..)/ groupby 함수를 통해 역별, 날짜별 totalpopulation의 mean
a=stationpop_df.groupby(['station','date'])['totalpopulation'].mean()


# In[157]:


#날짜별 may 첫째 주 월-목 slice
may1wk_df=a.iloc[:,0:4]
may1wk_df.to_csv('may1wk.txt',index=True)


# In[158]:


#날짜별 may 첫째 주 금-일 slice
may1wnd_df=a.iloc[:,4:7]
may1wnd_df.to_csv('may1wnd.txt',index=True)


# In[159]:


#날짜별 may 셋째 주 월-목 slice
may3wk_df=a.iloc[:,9:13]
may3wk_df.to_csv('may3wk.txt',index=True)


# In[160]:


#날짜별 may 셋째 주 금-일 slice
may3wnd_df=a.iloc[:,13:16]
may3wnd_df.tail()
may3wnd_df.to_csv('may3wnd.txt',index=True)


# In[161]:


#날짜별 may 넷째 주 월-목 slice
may4wk_df=a.iloc[:,16:20]
may4wk_df.tail()
may4wk_df.to_csv('may4wk.txt',index=True)


# In[162]:


#날짜별 may 넷째 주 금-일 slice
may4wnd_df=a.iloc[:,20:23]
may4wnd_df.tail()
may4wnd_df.to_csv('may4wnd.txt',index=True)


# In[175]:


#서울열린데이터광장에서 업데이트가 늦어서, 6월 3일 데이터만 따로 받아 정리
b=stationpop_df[2:3496]
b.head()


# In[209]:


stationpop1_df.drop(['getin','getout'],axis=1,inplace=True)
b=stationpop_df.groupby(['station','date'])['totalpopulation'].mean()
b=pd.DataFrame(b.unstack())
b.head(50)
b.shape


# In[215]:


#날짜별 may 다섯째 주 월-목 slice
may5wk_df=b.iloc[:,23:27]
may5wk_df.tail()
may5wk_df.to_csv('may5wk.txt',index=True)


# In[216]:


#날짜별 may 다섯째 주 금-일 slice
may5wnd_df=b.iloc[:,27:29]
may5wnd_df.tail()
may5wnd_df.to_csv('may5wnd.txt',index=True)


# In[239]:


#월화수목+금토일 concat 합수를 이용해 merge
may5_df=pd.concat([may5wk_df,may5wnd_df],axis=1)
may5_df.to_csv('may5.txt',index=True)

may4_df=pd.concat([may4wk_df,may4wnd_df],axis=1)
may4_df.to_csv('may4.txt',index=True)
may4_df.head()


# In[241]:


may3_df=pd.concat([may3wk_df,may3wnd_df],axis=1)
may3_df.to_csv('may3.txt',index=True)
may3_df.tail()


# In[242]:


may1_df=pd.concat([may1wk_df,may1wnd_df],axis=1)
may1_df.to_csv('may1.txt',index=True)
may1_df.tail()


# In[247]:


may1_df=pd.read_csv('may1.txt')
may1_df.to_csv('may1.txt',index=True)
may1_df.tail()


# In[275]:


c=stationpop_df.iloc[:582,1:3]
c=pd.merge(may5_df,c,on='station')


# In[276]:


c.shape


# In[277]:


#역별 구, 동 연결 짓기
dong=pd.read_csv('stationdong.csv')


# In[292]:


dong_df=pd.read_csv('hyunjin.txt')


# In[293]:


dong_df.head(10
            )


# In[294]:


stationpop_df.head()


# In[359]:


stationpop_df.sort_values(by='line', ascending=True)
a_df=stationpop_df.groupby(['line'])


# In[399]:


#서울시를 많이 벗어나는 호선은 제거
stationpop_df=stationpop_df[stationpop_df.line != '신분당선']
stationpop_df=stationpop_df[stationpop_df.line != '경강선']
stationpop_df=stationpop_df[stationpop_df.line != '공항선']
stationpop_df=stationpop_df[stationpop_df.line != '인천선']
stationpop_df=stationpop_df[stationpop_df.line != '분당선']
stationpop_df=stationpop_df[stationpop_df.line != '장항선']
stationpop_df=stationpop_df[stationpop_df.line != '안산선']
stationpop_df=stationpop_df[stationpop_df.line != '수인선']
stationpop_df=stationpop_df[stationpop_df.line != '과천선']
stationpop_df=stationpop_df[stationpop_df.line != '공항철도 1호선']
stationpop_df=stationpop_df[stationpop_df.line != '경춘선']
stationpop_df=stationpop_df[stationpop_df.line != '경인선']
stationpop_df=stationpop_df[stationpop_df.line != '중앙선']
stationpop_df=stationpop_df[stationpop_df.line != '일산선']
stationpop_df=stationpop_df[stationpop_df.line != '경원선']
stationpop_df=stationpop_df[stationpop_df.line != '경부선']


# In[401]:


#남은 호선 확인
stationpop_df['line'].unique()


# In[427]:


#분당선에서 서울숲만 추가하기 위해 서울숲 데이터만 정렬
seoulforest_df=stationpop1_df[stationpop1_df.station== '서울숲']
seoulforest_df.head()


# In[454]:


stationpop2_df.to_csv('REAL_totalpop.txt',index=None)


# In[428]:


seoulforest_df.to_csv('seoulforest.txt',index=None)


# In[434]:


#호선 정리한 데이터에 서울숲만 추가
stationpop2_df=pd.concat([stationpop_df,seoulforest_df],axis=0)
stationpop2_df['line'].unique()


# In[447]:



stationpop2_df=stationpop2_df.sort_values(by='date', ascending=True)

stationpop2_df=stationpop2_df.reset_index()

stationpop2_df.drop('index',axis=1,inplace=True)


# In[451]:


stationpop2_df.head()
stationpop2_df.drop('level_0',axis=1,inplace=True)


# In[559]:


stationpop2_df.head()


# In[561]:


#2차 역별 정렬 /역별 승하차인원을 역별 날짜별 totalpopulation의 sum(같은 역이어도
#지하철선이 여럿 지나는 환승역은 유동인구가 따로 구분되어 있음)으로 정리
b=stationpop2_df.groupby(['station','date'])['totalpopulation'].sum()
b=pd.DataFrame(b.unstack())
b.head()


# In[562]:


may1_df=b.iloc[:,0:7]
may1_df.to_csv('may1.txt',index=True)
may1_df.head()


# In[563]:


may3_df=b.iloc[:,9:16]
may3_df.to_csv('may3.txt',index=True)
may3_df.head()


# In[564]:


may4_df=b.iloc[:,16:23]
may4_df.to_csv('may4.txt',index=True)
may4_df.head()


# In[574]:


may5_df=b.iloc[:,23:30]
may5_df.to_csv('may5.txt',index=True)
may5_df.head()


# In[566]:


b.shape


# In[481]:


may5_df.shape


# In[484]:


#동과 역 매칭 데이터 정리
dong=pd.read_csv('hyunjin.txt')


# In[485]:


dong.head()


# In[487]:


hyunjin=dong.sort_values(by='역명', ascending=True)


# In[490]:


hyunjin.to_csv('sorthyunjin.txt',index=False)


# In[491]:


hyunjin.shape


# In[493]:


hyunjin.drop(['호선','행정구'],axis=1,inplace=True)


# In[498]:


hyunjin.head()


# In[497]:


hyunjin=hyunjin.reset_index()


# In[499]:


hyunjin.drop(['index'],axis=1,inplace=True)


# In[500]:


hyunjin.head()


# In[504]:


hyunjin.set_index('행정동').to_dict()


# In[567]:


may5_df.head()


# In[533]:


#6월 3일 데이터만 따로
may5last_df=pd.read_csv('0603pop.csv',names=['date','line','station','getin','getout','totalpopulation'])


# In[529]:


may5last_df.head()
may5last_df.column=['date','line','station','getin','getout','total']


# In[534]:


may5last_df.head()


# In[554]:


d=may5last_df.groupby(['station','date'])['totalpopulation'].sum()
d=pd.DataFrame(d.unstack())
d.head(50)
d.shape


# In[547]:


c.head(50)
pd.merge(may5_df,c,how='left',left_on='station',right_on='date')


# In[544]:


may5_df=pd.read_csv('may5.txt')


# In[582]:


may5_df.head()


# In[580]:


may5_df=pd.read_csv('may5.txt')
may5last_df=pd.read_csv('may5last.txt')


# In[585]:


may5_df=pd.merge(may5_df,may5last_df,how='left',left_on='station',right_on='station')


# In[593]:


may5_df.to_csv('may5.txt')


# In[592]:


may5_df.dtypes


# In[591]:


may5_df['20180603']=may5_df['20180603'].astype(float)


# In[598]:


os.getcwd()


# In[656]:


stationgudong=pd.read_excel('REALstation_gu_dong.xls')


# In[657]:


station_df=stationgudong['station']


# In[658]:


station_df=pd.DataFrame(station_df)


# In[671]:


#merge에서 핵심 코드 날씨랑 역별 유동인구 합치기
wea1=pd.read_excel('week1_weather.xls')
MAY1=pd.merge(may1,wea1,how='left',on='station')
MAY1.to_excel('MAY1.xls')


# In[675]:


wea4=pd.read_excel('week4_weather.xls')
MAY4=pd.merge(may5,wea4,how='left',on='station')
MAY4.to_excel('MAY4.xls')


# In[676]:


MAY4.drop(['장암','상동'],axis=0,inplace=True)
MAY4.to_excel('MAY4week.xls')


# In[625]:


week1_weather=pd.read_excel('week1_weather.xls')


# In[630]:


week1_weather.head(100)


# In[654]:


week1_weather.head()


# In[678]:


dong_df=pd.read_excel('REALstation_gu_dong.xls')


# In[679]:


dong_df.head()


# In[685]:


#동과 역 합치기
MAY4week=pd.merge(MAY4,dong_df,how='right',on='station')
MAY4week.to_excel('MAY4.xls')


# In[686]:


#음식점숙박업종사자 매핑
eat_dict={'동': '소계', '합계': 470357, '소계': 15387, '사직동': 4166, '삼청동': 1106, '부암동': 380, '평창동': 509, '무악동': 88, '교남동': 205, '가회동': 961, '종로1.2.3.4가동': 10518, '종로5·6가동': 2052, '이화동': 1867, '창신1동': 699, '창신2동': 284, '창신3동': 60, '숭인1동': 134, '숭인2동': 605, '청운효자동': 721, '혜화동': 2418, '소공동': 6453, '회현동': 3388, '명동': 9395, '필동': 1855, '장충동': 1717, '광희동': 3609, '을지로동': 1766, '신당5동': 537, '황학동': 663, '중림동': 648, '신당동': 1013, '다산동': 532, '약수동': 415, '청구동': 243, '동화동': 302, '후암동': 438, '용산2가동': 522, '남영동': 2112, '원효로2동': 237, '효창동': 139, '용문동': 242, '이촌1동': 797, '이촌2동': 63, '이태원1동': 3586, '이태원2동': 996, '서빙고동': 232, '보광동': 410, '청파동': 1114, '원효로1동': 926, '한강로동': 2689, '한남동': 3302, '왕십리2동': 185, '마장동': 620, '사근동': 1942, '행당1동': 1410, '행당2동': 205, '응봉동': 91, '금호1가동': 158, '금호4가동': 230, '성수1가1동': 364, '성수1가2동': 845, '성수2가1동': 855, '성수2가3동': 1421, '송정동': 153, '용답동': 695, '왕십리도선동': 1063, '금호2.3가동': 437, '옥수동': 399, '화양동': 4133, '군자동': 1124, '중곡1동': 519, '중곡2동': 533, '중곡3동': 469, '중곡4동': 473, '능동': 581, '구의1동': 958, '구의2동': 540, '구의3동': 1431, '광장동': 2096, '자양1동': 733, '자양2동': 513, '자양3동': 1219, '자양4동': 1285, '회기동': 1400, '휘경1동': 705, '휘경2동': 252, '청량리동': 850, '용신동': 1943, '제기동': 1073, '전농1동': 1538, '전농2동': 424, '답십리1동': 704, '답십리2동': 449, '장안1동': 1628, '장안2동': 1849, '이문1동': 1246, '이문2동': 219, '면목2동': 534, '면목4동': 289, '면목5동': 187, '면목7동': 500, '상봉1동': 679, '상봉2동': 1607, '중화1동': 244, '중화2동': 929, '묵1동': 716, '묵2동': 557, '망우3동': 291, '신내1동': 800, '신내2동': 478, '면목본동': 897, '면목3.8동': 898, '망우본동': 1091, '돈암1동': 97, '돈암2동': 78, '안암동': 1614, '보문동': 393, '정릉1동': 289, '정릉2동': 360, '정릉3동': 444, '정릉4동': 374, '길음1동': 616, '길음2동': 929, '월곡1동': 475, '월곡2동': 970, '장위1동': 229, '장위2동': 474, '장위3동': 189, '성북동': 867, '삼선동': 1014, '동선동': 2094, '종암동': 868, '석관동': 946, '번1동': 1122, '번2동': 138, '번3동': 265, '수유1동': 491, '수유2동': 497, '수유3동': 2156, '삼양동': 278, '미아동': 840, '송중동': 1811, '송천동': 974, '삼각산동': 332, '우이동': 936, '인수동': 521, '쌍문1동': 343, '쌍문2동': 565, '쌍문3동': 434, '쌍문4동': 150, '방학1동': 1193, '방학2동': 313, '방학3동': 295, '창1동': 443, '창2동': 375, '창3동': 314, '창4동': 651, '창5동': 1037, '도봉1동': 866, '도봉2동': 509, '월계1동': 911, '월계2동': 214, '월계3동': 222, '공릉2동': 1156, '하계1동': 743, '하계2동': 99, '중계본동': 555, '중계1동': 600, '중계4동': 654, '상계1동': 1207, '상계2동': 2540, '상계5동': 428, '상계8동': 165, '상계9동': 208, '상계10동': 132, '상계3.4동': 385, '상계6.7동': 1702, '중계2.3동': 967, '공릉1동': 1343, '녹번동': 756, '불광1동': 969, '갈현1동': 1227, '갈현2동': 1009, '구산동': 327, '대조동': 1446, '응암1동': 888, '응암2동': 199, '신사1동': 456, '신사2동': 177, '증산동': 410, '수색동': 248, '진관동': 1556, '불광2동': 479, '응암3동': 927, '역촌동': 936, '천연동': 373, '홍제1동': 432, '홍제3동': 593, '홍제2동': 245, '홍은1동': 267, '홍은2동': 963, '남가좌1동': 452, '남가좌2동': 637, '북가좌1동': 234, '북가좌2동': 641, '충현동': 1269, '북아현동': 228, '신촌동': 6553, '연희동': 1466, '용강동': 1613, '대흥동': 1024, '염리동': 422, '신수동': 446, '서교동': 11517, '합정동': 1224, '망원1동': 751, '망원2동': 536, '연남동': 1280, '성산1동': 577, '성산2동': 656, '상암동': 2815, '도화동': 1483, '서강동': 1668, '공덕동': 1390, '아현동': 879, '목1동': 2753, '목2동': 453, '목3동': 512, '목4동': 547, '신월1동': 533, '신월2동': 218, '신월3동': 289, '신월4동': 353, '신월5동': 346, '신월6동': 156, '신월7동': 326, '신정1동': 619, '신정2동': 546, '신정3동': 554, '신정6동': 218, '신정7동': 432, '목5동': 956, '신정4동': 1449, '염창동': 1023, '등촌1동': 1082, '등촌2동': 318, '등촌3동': 1888, '화곡본동': 603, '화곡2동': 173, '화곡3동': 770, '화곡4동': 547, '화곡6동': 1968, '화곡8동': 426, '가양1동': 953, '가양2동': 210, '가양3동': 197, '발산1동': 1129, '공항동': 1220, '방화1동': 1092, '방화2동': 1506, '방화3동': 289, '화곡1동': 2101, '우장산동': 736, '신도림동': 1823, '구로1동': 196, '구로3동': 3496, '구로4동': 865, '구로5동': 1719, '고척1동': 995, '고척2동': 437, '개봉2동': 453, '개봉3동': 311, '오류1동': 567, '오류2동': 581, '수궁동': 332, '가리봉동': 447, '구로2동': 1442, '개봉1동': 784, '가산동': 4861, '독산1동': 1234, '독산2동': 372, '독산3동': 728, '독산4동': 585, '시흥1동': 1845, '시흥2동': 85, '시흥3동': 286, '시흥4동': 183, '시흥5동': 504, '여의동': 9766, '당산1동': 1217, '당산2동': 1374, '양평1동': 739, '양평2동': 1033, '신길1동': 554, '신길3동': 315, '신길4동': 137, '신길5동': 264, '신길6동': 605, '신길7동': 356, '대림1동': 506, '대림2동': 889, '대림3동': 762, '영등포본동': 939, '영등포동': 5037, '도림동': 280, '문래동': 1573, '노량진2동': 797, '상도1동': 1380, '상도2동': 676, '상도3동': 351, '상도4동': 353, '사당1동': 1232, '사당3동': 348, '사당4동': 208, '사당5동': 157, '대방동': 1006, '신대방1동': 450, '신대방2동': 971, '흑석동': 1237, '노량진1동': 2171, '사당2동': 1294, '보라매동': 682, '청림동': 144, '행운동': 768, '낙성대동': 1760, '중앙동': 711, '인헌동': 457, '남현동': 930, '서원동': 1782, '신원동': 330, '서림동': 478, '신사동': 4454, '신림동': 1913, '난향동': 106, '조원동': 966, '대학동': 2132, '은천동': 641, '성현동': 175, '청룡동': 1463, '난곡동': 258, '삼성동': 220, '미성동': 514, '서초1동': 1781, '서초2동': 2740, '서초3동': 4734, '서초4동': 3387, '잠원동': 1924, '반포본동': 330, '반포1동': 837, '반포2동': 187, '반포3동': 1150, '반포4동': 5121, '방배본동': 1091, '방배1동': 1030, '방배2동': 1636, '방배3동': 413, '방배4동': 845, '양재1동': 2273, '양재2동': 2434, '내곡동': 290, '논현1동': 3893, '논현2동': 4629, '삼성1동': 5337, '삼성2동': 2183, '대치1동': 921, '대치4동': 2979, '역삼1동': 12581, '역삼2동': 1699, '도곡1동': 1016, '도곡2동': 1261, '개포1동': 51, '개포4동': 575, '일원본동': 393, '일원1동': 612, '일원2동': 274, '수서동': 757, '세곡동': 468, '압구정동': 3802, '청담동': 4493, '대치2동': 2739, '개포2동': 418, '풍납1동': 249, '풍납2동': 498, '거여1동': 291, '거여2동': 344, '마천1동': 235, '마천2동': 414, '방이1동': 999, '방이2동': 2726, '오륜동': 585, '오금동': 954, '송파1동': 957, '송파2동': 387, '석촌동': 1243, '삼전동': 1126, '가락본동': 2013, '가락1동': 295, '가락2동': 819, '문정1동': 531, '문정2동': 1467, '장지동': 563, '위례동': 374, '잠실본동': 3381, '잠실4동': 256, '잠실6동': 3116, '잠실7동': 59, '잠실2동': 459, '잠실3동': 2521, '강일동': 462, '상일동': 478, '명일1동': 940, '명일2동': 730, '고덕1동': 145, '고덕2동': 258, '암사2동': 481, '암사3동': 124, '천호1동': 669, '천호3동': 964, '성내1동': 981, '성내2동': 1122, '성내3동': 1549, '둔촌1동': 27, '둔촌2동': 874, '암사1동': 668, '천호2동': 2291, '길동': 2624}


# In[697]:


#딕셔너리 매핑 코드
for i in [may1,may2,may3,may4]:
    i['foodindustry']=i['행정동'].map(eat_dict)


# In[720]:


#읽어오기 코드
may1=pd.read_excel('MAY1.xls')
may2=pd.read_excel('MAY2.xls')
may3=pd.read_excel('MAY3.xls')
may4=pd.read_excel('MAY4.xls')


# In[13]:


may1=pd.read_excel('MAY1(날씨+미세먼지+대학).xls')
may2=pd.read_excel('MAY2(날씨+미세먼지+대학).xls')
may3=pd.read_excel('MAY3(날씨+미세먼지+대학).xls')
may4=pd.read_excel('MAY4(날씨+미세먼지+대학).xls')


# In[20]:


#내보내기 코드
may1.to_excel('MAY1(날씨+미세먼지+대학).xls')
may2.to_excel('MAY2(날씨+미세먼지+대학).xls')
may3.to_excel('MAY3(날씨+미세먼지+대학).xls')
may4.to_excel('MAY4(날씨+미세먼지+대학).xls')


# In[4]:


humanpopulation=pd.read_excel('humanpopulation.xls')


# In[5]:


humanpopulation.head()


# In[6]:


humanpopulation.drop(['기간','자치구','인구','면적'],axis=1,inplace=True)


# In[7]:


#인구밀도 매핑
human_dict= humanpopulation.set_index('동').to_dict()
print(human_dict)


# In[8]:


human_dict= {'합계': 16728, '소계': 17909, '사직동': 7900, '삼청동': 2079, '부암동': 4725, '평창동': 2160, '무악동': 23264, '교남동': 29609, '가회동': 8624, '종로1.2.3.4가동': 3656, '종로5·6가동': 9483, '이화동': 11221, '창신1동': 20274, '창신2동': 39515, '창신3동': 32722, '숭인1동': 29848, '숭인2동': 28971, '청운효자동': 5294, '혜화동': 18240, '소공동': 2934, '회현동': 7087, '명동': 3504, '필동': 4285, '장충동': 4153, '광희동': 7939, '을지로동': 2977, '신당5동': 25205, '황학동': 39682, '중림동': 24115, '신당동': 17353, '다산동': 30194, '약수동': 38333, '청구동': 44115, '동화동': 43646, '후암동': 21914, '용산2가동': 6304, '남영동': 7214, '원효로2동': 21455, '효창동': 21805, '용문동': 45568, '이촌1동': 10126, '이촌2동': 7565, '이태원1동': 15423, '이태원2동': 12807, '서빙고동': 5098, '보광동': 23297, '청파동': 23333, '원효로1동': 25875, '한강로동': 6227, '한남동': 7875, '왕십리2동': 44354, '마장동': 22824, '사근동': 11542, '행당1동': 24385, '행당2동': 60531, '응봉동': 29291, '금호1가동': 28676, '금호4가동': 17205, '성수1가1동': 8927, '성수1가2동': 18442, '성수2가1동': 15918, '성수2가3동': 11705, '송정동': 17628, '용답동': 7193, '왕십리도선동': 38308, '금호2.3가동': 38648, '옥수동': 14078, '화양동': 21216, '군자동': 29703, '중곡1동': 26385, '중곡2동': 41469, '중곡3동': 29987, '중곡4동': 13628, '능동': 10762, '구의1동': 41779, '구의2동': 18659, '구의3동': 29885, '광장동': 15309, '자양1동': 42895, '자양2동': 16504, '자양3동': 25431, '자양4동': 22409, '회기동': 16475, '휘경1동': 23157, '휘경2동': 24005, '청량리동': 19219, '용신동': 20470, '제기동': 23534, '전농1동': 25139, '전농2동': 23763, '답십리1동': 31069, '답십리2동': 34967, '장안1동': 31674, '장안2동': 28850, '이문1동': 29973, '이문2동': 32542, '면목2동': 37064, '면목4동': 19007, '면목5동': 16386, '면목7동': 26100, '상봉1동': 30541, '상봉2동': 27419, '중화1동': 31146, '중화2동': 29309, '묵1동': 30224, '묵2동': 29204, '망우3동': 18946, '신내1동': 16427, '신내2동': 23251, '면목본동': 36416, '면목3.8동': 16578, '망우본동': 11254, '돈암1동': 34173, '돈암2동': 52644, '안암동': 13073, '보문동': 30821, '정릉1동': 42957, '정릉2동': 20936, '정릉3동': 4681, '정릉4동': 8761, '길음1동': 47844, '길음2동': 21284, '월곡1동': 34767, '월곡2동': 15311, '장위1동': 30480, '장위2동': 27637, '장위3동': 18978, '성북동': 6292, '삼선동': 29437, '동선동': 22759, '종암동': 29401, '석관동': 20016, '번1동': 36204, '번2동': 14350, '번3동': 22458, '수유1동': 21001, '수유2동': 30838, '수유3동': 28166, '삼양동': 30609, '미아동': 32097, '송중동': 24830, '송천동': 34057, '삼각산동': 54571, '우이동': 2000, '인수동': 11307, '쌍문1동': 18005, '쌍문2동': 38198, '쌍문3동': 34964, '쌍문4동': 39385, '방학1동': 44536, '방학2동': 30141, '방학3동': 11282, '창1동': 31076, '창2동': 29680, '창3동': 22893, '창4동': 30103, '창5동': 37796, '도봉1동': 2682, '도봉2동': 35324, '월계1동': 20814, '월계2동': 14075, '월계3동': 28474, '공릉2동': 6143, '하계1동': 19290, '하계2동': 47829, '중계본동': 13934, '중계1동': 45759, '중계4동': 12999, '상계1동': 7419, '상계2동': 35944, '상계5동': 61473, '상계8동': 37527, '상계9동': 28215, '상계10동': 21808, '상계3.4동': 4936, '상계6.7동': 32525, '중계2.3동': 43071, '공릉1동': 28389, '녹번동': 18465, '불광1동': 13532, '갈현1동': 26382, '갈현2동': 32195, '구산동': 24507, '대조동': 39249, '응암1동': 22000, '응암2동': 27836, '신사1동': 33535, '신사2동': 22210, '증산동': 20894, '수색동': 10721, '진관동': 4820, '불광2동': 21890, '응암3동': 42284, '역촌동': 43494, '천연동': 19964, '홍제1동': 19855, '홍제3동': 21236, '홍제2동': 14294, '홍은1동': 14760, '홍은2동': 14619, '남가좌1동': 33855, '남가좌2동': 30179, '북가좌1동': 38037, '북가좌2동': 41331, '충현동': 16757, '북아현동': 38452, '신촌동': 8863, '연희동': 13386, '용강동': 26815, '대흥동': 15785, '염리동': 26484, '신수동': 28009, '서교동': 16109, '합정동': 11771, '망원1동': 19114, '망원2동': 29876, '연남동': 27389, '성산1동': 25761, '성산2동': 19597, '상암동': 3978, '도화동': 37237, '서강동': 18014, '공덕동': 40266, '아현동': 33659, '목1동': 23190, '목2동': 31056, '목3동': 41909, '목4동': 48414, '신월1동': 35272, '신월2동': 38164, '신월3동': 20286, '신월4동': 37837, '신월5동': 23284, '신월6동': 17263, '신월7동': 19456, '신정1동': 31230, '신정2동': 40887, '신정3동': 18680, '신정6동': 26818, '신정7동': 25444, '목5동': 24171, '신정4동': 36122, '염창동': 23506, '등촌1동': 39883, '등촌2동': 24190, '등촌3동': 43297, '화곡본동': 33009, '화곡2동': 43432, '화곡3동': 44908, '화곡4동': 28221, '화곡6동': 22410, '화곡8동': 51126, '가양1동': 6944, '가양2동': 16246, '가양3동': 16940, '발산1동': 13316, '공항동': 2627, '방화1동': 44898, '방화2동': 3858, '방화3동': 10679, '화곡1동': 48924, '우장산동': 34421, '신도림동': 25756, '구로1동': 21921, '구로3동': 27078, '구로4동': 59865, '구로5동': 33369, '고척1동': 21475, '고척2동': 29614, '개봉2동': 42866, '개봉3동': 27490, '오류1동': 36520, '오류2동': 9892, '수궁동': 9682, '가리봉동': 40518, '구로2동': 20394, '개봉1동': 26818, '가산동': 9236, '독산1동': 18862, '독산2동': 37783, '독산3동': 33243, '독산4동': 32197, '시흥1동': 22012, '시흥2동': 18858, '시흥3동': 11276, '시흥4동': 26670, '시흥5동': 15739, '여의동': 4009, '당산1동': 28348, '당산2동': 23022, '양평1동': 19539, '양평2동': 7590, '신길1동': 31052, '신길3동': 37042, '신길4동': 30606, '신길5동': 27828, '신길6동': 29440, '신길7동': 27019, '대림1동': 34373, '대림2동': 39656, '대림3동': 29654, '영등포본동': 25199, '영등포동': 19091, '도림동': 25027, '문래동': 21263, '노량진2동': 22789, '상도1동': 32100, '상도2동': 28111, '상도3동': 43840, '상도4동': 40476, '사당1동': 30218, '사당3동': 27138, '사당4동': 39316, '사당5동': 23361, '대방동': 26248, '신대방1동': 44237, '신대방2동': 20259, '흑석동': 19960, '노량진1동': 20749, '사당2동': 10487, '보라매동': 34847, '청림동': 55650, '행운동': 42221, '낙성대동': 7878, '중앙동': 39759, '인헌동': 25693, '남현동': 5817, '서원동': 36218, '신원동': 36255, '서림동': 25519, '신사동': 9579, '신림동': 39759, '난향동': 21089, '조원동': 29779, '대학동': 2963, '은천동': 46135, '성현동': 49196, '청룡동': 24964, '난곡동': 31348, '삼성동': 10085, '미성동': 24291, '서초1동': 15163, '서초2동': 13521, '서초3동': 10389, '서초4동': 35551, '잠원동': 19852, '반포본동': 12699, '반포1동': 28665, '반포2동': 18153, '반포3동': 14626, '반포4동': 14296, '방배본동': 32545, '방배1동': 24704, '방배2동': 14104, '방배3동': 9410, '방배4동': 26931, '양재1동': 8207, '양재2동': 3145, '내곡동': 1488, '논현1동': 19349, '논현2동': 15356, '삼성1동': 7831, '삼성2동': 23894, '대치1동': 31977, '대치4동': 29032, '역삼1동': 15546, '역삼2동': 32263, '도곡1동': 22433, '도곡2동': 34200, '개포1동': 15835, '개포4동': 12433, '일원본동': 9700, '일원1동': 18596, '일원2동': 13280, '수서동': 11739, '세곡동': 7063, '압구정동': 11087, '청담동': 12991, '대치2동': 20783, '개포2동': 5848, '풍납1동': 22073, '풍납2동': 15966, '거여1동': 26404, '거여2동': 33802, '마천1동': 38012, '마천2동': 23435, '방이1동': 33516, '방이2동': 32000, '오륜동': 6171, '오금동': 23085, '송파1동': 33314, '송파2동': 40517, '석촌동': 36495, '삼전동': 35394, '가락본동': 25001, '가락1동': 675, '가락2동': 36126, '문정1동': 38586, '문정2동': 12518, '장지동': 25706, '위례동': 11080, '잠실본동': 31805, '잠실4동': 19506, '잠실6동': 6247, '잠실7동': 17407, '잠실2동': 16965, '잠실3동': 24678, '강일동': 12027, '상일동': 3734, '명일1동': 37064, '명일2동': 18773, '고덕1동': 15955, '고덕2동': 4096, '암사2동': 12704, '암사3동': 7581, '천호1동': 41899, '천호3동': 35687, '성내1동': 36566, '성내2동': 38757, '성내3동': 34558, '둔촌1동': 2171, '둔촌2동': 29510, '암사1동': 37680, '천호2동': 23370, '길동': 23236}


# In[14]:


for i in [may1,may2,may3,may4]:
    i['population_density']=i['행정동'].map(human_dict)


# In[19]:


for i in [may1,may2,may3,may4]:
    i['foodindustry']=i['행정동'].map(food_dict)


# In[18]:


food_dict={'합계': 470357, '소계': 15387, '사직동': 4166, '삼청동': 1106, '부암동': 380, '평창동': 509, '무악동': 88, '교남동': 205, '가회동': 961, '종로1.2.3.4가동': 10518, '종로5·6가동': 2052, '이화동': 1867, '창신1동': 699, '창신2동': 284, '창신3동': 60, '숭인1동': 134, '숭인2동': 605, '청운효자동': 721, '혜화동': 2418, '소공동': 6453, '회현동': 3388, '명동': 9395, '필동': 1855, '장충동': 1717, '광희동': 3609, '을지로동': 1766, '신당5동': 537, '황학동': 663, '중림동': 648, '신당동': 1013, '다산동': 532, '약수동': 415, '청구동': 243, '동화동': 302, '후암동': 438, '용산2가동': 522, '남영동': 2112, '원효로2동': 237, '효창동': 139, '용문동': 242, '이촌1동': 797, '이촌2동': 63, '이태원1동': 3586, '이태원2동': 996, '서빙고동': 232, '보광동': 410, '청파동': 1114, '원효로1동': 926, '한강로동': 2689, '한남동': 3302, '왕십리2동': 185, '마장동': 620, '사근동': 1942, '행당1동': 1410, '행당2동': 205, '응봉동': 91, '금호1가동': 158, '금호4가동': 230, '성수1가1동': 364, '성수1가2동': 845, '성수2가1동': 855, '성수2가3동': 1421, '송정동': 153, '용답동': 695, '왕십리도선동': 1063, '금호2.3가동': 437, '옥수동': 399, '화양동': 4133, '군자동': 1124, '중곡1동': 519, '중곡2동': 533, '중곡3동': 469, '중곡4동': 473, '능동': 581, '구의1동': 958, '구의2동': 540, '구의3동': 1431, '광장동': 2096, '자양1동': 733, '자양2동': 513, '자양3동': 1219, '자양4동': 1285, '회기동': 1400, '휘경1동': 705, '휘경2동': 252, '청량리동': 850, '용신동': 1943, '제기동': 1073, '전농1동': 1538, '전농2동': 424, '답십리1동': 704, '답십리2동': 449, '장안1동': 1628, '장안2동': 1849, '이문1동': 1246, '이문2동': 219, '면목2동': 534, '면목4동': 289, '면목5동': 187, '면목7동': 500, '상봉1동': 679, '상봉2동': 1607, '중화1동': 244, '중화2동': 929, '묵1동': 716, '묵2동': 557, '망우3동': 291, '신내1동': 800, '신내2동': 478, '면목본동': 897, '면목3.8동': 898, '망우본동': 1091, '돈암1동': 97, '돈암2동': 78, '안암동': 1614, '보문동': 393, '정릉1동': 289, '정릉2동': 360, '정릉3동': 444, '정릉4동': 374, '길음1동': 616, '길음2동': 929, '월곡1동': 475, '월곡2동': 970, '장위1동': 229, '장위2동': 474, '장위3동': 189, '성북동': 867, '삼선동': 1014, '동선동': 2094, '종암동': 868, '석관동': 946, '번1동': 1122, '번2동': 138, '번3동': 265, '수유1동': 491, '수유2동': 497, '수유3동': 2156, '삼양동': 278, '미아동': 840, '송중동': 1811, '송천동': 974, '삼각산동': 332, '우이동': 936, '인수동': 521, '쌍문1동': 343, '쌍문2동': 565, '쌍문3동': 434, '쌍문4동': 150, '방학1동': 1193, '방학2동': 313, '방학3동': 295, '창1동': 443, '창2동': 375, '창3동': 314, '창4동': 651, '창5동': 1037, '도봉1동': 866, '도봉2동': 509, '월계1동': 911, '월계2동': 214, '월계3동': 222, '공릉2동': 1156, '하계1동': 743, '하계2동': 99, '중계본동': 555, '중계1동': 600, '중계4동': 654, '상계1동': 1207, '상계2동': 2540, '상계5동': 428, '상계8동': 165, '상계9동': 208, '상계10동': 132, '상계3.4동': 385, '상계6.7동': 1702, '중계2.3동': 967, '공릉1동': 1343, '녹번동': 756, '불광1동': 969, '갈현1동': 1227, '갈현2동': 1009, '구산동': 327, '대조동': 1446, '응암1동': 888, '응암2동': 199, '신사1동': 456, '신사2동': 177, '증산동': 410, '수색동': 248, '진관동': 1556, '불광2동': 479, '응암3동': 927, '역촌동': 936, '천연동': 373, '홍제1동': 432, '홍제3동': 593, '홍제2동': 245, '홍은1동': 267, '홍은2동': 963, '남가좌1동': 452, '남가좌2동': 637, '북가좌1동': 234, '북가좌2동': 641, '충현동': 1269, '북아현동': 228, '신촌동': 6553, '연희동': 1466, '용강동': 1613, '대흥동': 1024, '염리동': 422, '신수동': 446, '서교동': 11517, '합정동': 1224, '망원1동': 751, '망원2동': 536, '연남동': 1280, '성산1동': 577, '성산2동': 656, '상암동': 2815, '도화동': 1483, '서강동': 1668, '공덕동': 1390, '아현동': 879, '목1동': 2753, '목2동': 453, '목3동': 512, '목4동': 547, '신월1동': 533, '신월2동': 218, '신월3동': 289, '신월4동': 353, '신월5동': 346, '신월6동': 156, '신월7동': 326, '신정1동': 619, '신정2동': 546, '신정3동': 554, '신정6동': 218, '신정7동': 432, '목5동': 956, '신정4동': 1449, '염창동': 1023, '등촌1동': 1082, '등촌2동': 318, '등촌3동': 1888, '화곡본동': 603, '화곡2동': 173, '화곡3동': 770, '화곡4동': 547, '화곡6동': 1968, '화곡8동': 426, '가양1동': 953, '가양2동': 210, '가양3동': 197, '발산1동': 1129, '공항동': 1220, '방화1동': 1092, '방화2동': 1506, '방화3동': 289, '화곡1동': 2101, '우장산동': 736, '신도림동': 1823, '구로1동': 196, '구로3동': 3496, '구로4동': 865, '구로5동': 1719, '고척1동': 995, '고척2동': 437, '개봉2동': 453, '개봉3동': 311, '오류1동': 567, '오류2동': 581, '수궁동': 332, '가리봉동': 447, '구로2동': 1442, '개봉1동': 784, '가산동': 4861, '독산1동': 1234, '독산2동': 372, '독산3동': 728, '독산4동': 585, '시흥1동': 1845, '시흥2동': 85, '시흥3동': 286, '시흥4동': 183, '시흥5동': 504, '여의동': 9766, '당산1동': 1217, '당산2동': 1374, '양평1동': 739, '양평2동': 1033, '신길1동': 554, '신길3동': 315, '신길4동': 137, '신길5동': 264, '신길6동': 605, '신길7동': 356, '대림1동': 506, '대림2동': 889, '대림3동': 762, '영등포본동': 939, '영등포동': 5037, '도림동': 280, '문래동': 1573, '노량진2동': 797, '상도1동': 1380, '상도2동': 676, '상도3동': 351, '상도4동': 353, '사당1동': 1232, '사당3동': 348, '사당4동': 208, '사당5동': 157, '대방동': 1006, '신대방1동': 450, '신대방2동': 971, '흑석동': 1237, '노량진1동': 2171, '사당2동': 1294, '보라매동': 682, '청림동': 144, '행운동': 768, '낙성대동': 1760, '중앙동': 711, '인헌동': 457, '남현동': 930, '서원동': 1782, '신원동': 330, '서림동': 478, '신사동': 4454, '신림동': 1913, '난향동': 106, '조원동': 966, '대학동': 2132, '은천동': 641, '성현동': 175, '청룡동': 1463, '난곡동': 258, '삼성동': 220, '미성동': 514, '서초1동': 1781, '서초2동': 2740, '서초3동': 4734, '서초4동': 3387, '잠원동': 1924, '반포본동': 330, '반포1동': 837, '반포2동': 187, '반포3동': 1150, '반포4동': 5121, '방배본동': 1091, '방배1동': 1030, '방배2동': 1636, '방배3동': 413, '방배4동': 845, '양재1동': 2273, '양재2동': 2434, '내곡동': 290, '논현1동': 3893, '논현2동': 4629, '삼성1동': 5337, '삼성2동': 2183, '대치1동': 921, '대치4동': 2979, '역삼1동': 12581, '역삼2동': 1699, '도곡1동': 1016, '도곡2동': 1261, '개포1동': 51, '개포4동': 575, '일원본동': 393, '일원1동': 612, '일원2동': 274, '수서동': 757, '세곡동': 468, '압구정동': 3802, '청담동': 4493, '대치2동': 2739, '개포2동': 418, '풍납1동': 249, '풍납2동': 498, '거여1동': 291, '거여2동': 344, '마천1동': 235, '마천2동': 414, '방이1동': 999, '방이2동': 2726, '오륜동': 585, '오금동': 954, '송파1동': 957, '송파2동': 387, '석촌동': 1243, '삼전동': 1126, '가락본동': 2013, '가락1동': 295, '가락2동': 819, '문정1동': 531, '문정2동': 1467, '장지동': 563, '위례동': 374, '잠실본동': 3381, '잠실4동': 256, '잠실6동': 3116, '잠실7동': 59, '잠실2동': 459, '잠실3동': 2521, '강일동': 462, '상일동': 478, '명일1동': 940, '명일2동': 730, '고덕1동': 145, '고덕2동': 258, '암사2동': 481, '암사3동': 124, '천호1동': 669, '천호3동': 964, '성내1동': 981, '성내2동': 1122, '성내3동': 1549, '둔촌1동': 27, '둔촌2동': 874, '암사1동': 668, '천호2동': 2291, '길동': 2624}


# In[717]:


maindf=pd.read_csv('date_line_station_totalpop.txt')


# In[718]:


maindf.head()

